nandojve/hal_gigadevice/include/dt-bindings/pinctrl/gd32e507r(c-e)xx-pinctrl.h
/* I2C0_TXFRAME */
#define I2C0_TXFRAME_PB4 \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, NORMP)

/* I2C1_SCL */
#define I2C1_SCL_PB10 \
	GD32_PINMUX_AFIO('B', 10, ALTERNATE, NORMP)

/* I2C1_SDA */
#define I2C1_SDA_PB11 \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, NORMP)

/* I2C1_SMBA */
#define I2C1_SMBA_PB12 \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* I2C1_TXFRAME */
#define I2C1_TXFRAME_PB13 \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* I2C2_SCL */
#define I2C2_SCL_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)
#define I2C2_SCL_PB5 \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, NORMP)
#define I2C2_SCL_PC10 \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, NORMP)

/* I2C2_SDA */
#define I2C2_SDA_PB4 \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, NORMP)
#define I2C2_SDA_PB8 \
	GD32_PINMUX_AFIO('B', 8, ALTERNATE, NORMP)
#define I2C2_SDA_PC9 \
	GD32_PINMUX_AFIO('C', 9, ALTERNATE, NORMP)

/* I2C2_SMBA */
#define I2C2_SMBA_PA9 \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, NORMP)

/* I2S1_ADD_SD */
#define I2S1_ADD_SD_PB14_INP \
	GD32_PINMUX_AFIO('B', 14, GPIO_IN, NORMP)
#define I2S1_ADD_SD_PB14_OUT \
	GD32_PINMUX_AFIO('B', 14, ALTERNATE, NORMP)
#define I2S1_ADD_SD_PC2_INP \
	GD32_PINMUX_AFIO('C', 2, GPIO_IN, NORMP)
#define I2S1_ADD_SD_PC2_OUT \
	GD32_PINMUX_AFIO('C', 2, ALTERNATE, NORMP)

/* I2S1_CK */
#define I2S1_CK_PB13_INP \
	GD32_PINMUX_AFIO('B', 13, GPIO_IN, NORMP)
#define I2S1_CK_PB13_OUT \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* I2S1_MCK */
#define I2S1_MCK_PC6 \
	GD32_PINMUX_AFIO('C', 6, ALTERNATE, NORMP)

/* I2S1_SD */
#define I2S1_SD_PB15_INP \
	GD32_PINMUX_AFIO('B', 15, GPIO_IN, NORMP)
#define I2S1_SD_PB15_OUT \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, NORMP)

/* I2S1_WS */
#define I2S1_WS_PB12_INP \
	GD32_PINMUX_AFIO('B', 12, GPIO_IN, NORMP)
#define I2S1_WS_PB12_OUT \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* I2S2_ADD_SD */
#define I2S2_ADD_SD_PB4_INP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, NORMP)
#define I2S2_ADD_SD_PB4_OUT \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, NORMP)
#define I2S2_ADD_SD_PC11_INP \
	GD32_PINMUX_AFIO('C', 11, GPIO_IN, NORMP)
#define I2S2_ADD_SD_PC11_OUT \
	GD32_PINMUX_AFIO('C', 11, ALTERNATE, NORMP)

/* I2S2_CK */
#define I2S2_CK_PB3_INP_NORMP \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, I2S2_NORMP)
#define I2S2_CK_PB3_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, I2S2_NORMP)
#define I2S2_CK_PC10_INP_RMP \
	GD32_PINMUX_AFIO('C', 10, GPIO_IN, I2S2_RMP)
#define I2S2_CK_PC10_OUT_RMP \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, I2S2_RMP)

/* I2S2_MCK */
#define I2S2_MCK_PC7 \
	GD32_PINMUX_AFIO('C', 7, ALTERNATE, NORMP)

/* I2S2_SD */
#define I2S2_SD_PB5_INP_NORMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, I2S2_NORMP)
#define I2S2_SD_PB5_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, I2S2_NORMP)
#define I2S2_SD_PC12_INP_RMP \
	GD32_PINMUX_AFIO('C', 12, GPIO_IN, I2S2_RMP)
#define I2S2_SD_PC12_OUT_RMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, I2S2_RMP)

/* I2S2_WS */
#define I2S2_WS_PA15_INP_NORMP \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, I2S2_NORMP)
#define I2S2_WS_PA15_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, I2S2_NORMP)
#define I2S2_WS_PA4_INP_RMP \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, I2S2_RMP)
#define I2S2_WS_PA4_OUT_RMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, I2S2_RMP)

/* OSC32IN */
#define OSC32IN_PC14 \
	GD32_PINMUX_AFIO('C', 14, GPIO_IN, NORMP)

/* OSC32OUT */
#define OSC32OUT_PC15 \
	GD32_PINMUX_AFIO('C', 15, ALTERNATE, NORMP)

/* SHRTIMER_EXEV0 */
#define SHRTIMER_EXEV0_PC12 \
	GD32_PINMUX_AFIO('C', 12, GPIO_IN, NORMP)

/* SHRTIMER_EXEV1 */
#define SHRTIMER_EXEV1_PC11 \
	GD32_PINMUX_AFIO('C', 11, GPIO_IN, NORMP)

/* SHRTIMER_EXEV2 */
#define SHRTIMER_EXEV2_PB7 \
	GD32_PINMUX_AFIO('B', 7, GPIO_IN, NORMP)

/* SHRTIMER_EXEV3 */
#define SHRTIMER_EXEV3_PB6 \
	GD32_PINMUX_AFIO('B', 6, GPIO_IN, NORMP)

/* SHRTIMER_EXEV4 */
#define SHRTIMER_EXEV4_PB9 \
	GD32_PINMUX_AFIO('B', 9, GPIO_IN, NORMP)

/* SHRTIMER_EXEV5 */
#define SHRTIMER_EXEV5_PB5 \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, NORMP)

/* SHRTIMER_EXEV6 */
#define SHRTIMER_EXEV6_PB4 \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, NORMP)

/* SHRTIMER_EXEV7 */
#define SHRTIMER_EXEV7_PB8 \
	GD32_PINMUX_AFIO('B', 8, GPIO_IN, NORMP)

/* SHRTIMER_EXEV8 */
#define SHRTIMER_EXEV8_PB3 \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, NORMP)

/* SHRTIMER_EXEV9 */
#define SHRTIMER_EXEV9_PC6 \
	GD32_PINMUX_AFIO('C', 6, GPIO_IN, NORMP)

/* SHRTIMER_FLT0 */
#define SHRTIMER_FLT0_PA12 \
	GD32_PINMUX_AFIO('A', 12, GPIO_IN, NORMP)

/* SHRTIMER_FLT1 */
#define SHRTIMER_FLT1_PA15 \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, NORMP)

/* SHRTIMER_FLT2 */
#define SHRTIMER_FLT2_PB10 \
	GD32_PINMUX_AFIO('B', 10, GPIO_IN, NORMP)

/* SHRTIMER_FLT3 */
#define SHRTIMER_FLT3_PB11 \
	GD32_PINMUX_AFIO('B', 11, GPIO_IN, NORMP)

/* SHRTIMER_FLT4 */
#define SHRTIMER_FLT4_PC7 \
	GD32_PINMUX_AFIO('C', 7, GPIO_IN, NORMP)

/* SHRTIMER_SCIN */
#define SHRTIMER_SCIN_PB2 \
	GD32_PINMUX_AFIO('B', 2, GPIO_IN, NORMP)
#define SHRTIMER_SCIN_PB6 \
	GD32_PINMUX_AFIO('B', 6, GPIO_IN, NORMP)

/* SHRTIMER_SCOUT */
#define SHRTIMER_SCOUT_PB1 \
	GD32_PINMUX_AFIO('B', 1, GPIO_IN, NORMP)
#define SHRTIMER_SCOUT_PB3 \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, NORMP)

/* SHRTIMER_ST0CH0 */
#define SHRTIMER_ST0CH0_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)

/* SHRTIMER_ST0CH1 */
#define SHRTIMER_ST0CH1_PA9 \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, NORMP)

/* SHRTIMER_ST1CH0 */
#define SHRTIMER_ST1CH0_PA10 \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, NORMP)

/* SHRTIMER_ST1CH1 */
#define SHRTIMER_ST1CH1_PA11 \
	GD32_PINMUX_AFIO('A', 11, ALTERNATE, NORMP)

/* SHRTIMER_ST2CH0 */
#define SHRTIMER_ST2CH0_PB12 \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* SHRTIMER_ST2CH1 */
#define SHRTIMER_ST2CH1_PB13 \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* SHRTIMER_ST3CH0 */
#define SHRTIMER_ST3CH0_PB14 \
	GD32_PINMUX_AFIO('B', 14, ALTERNATE, NORMP)

/* SHRTIMER_ST3CH1 */
#define SHRTIMER_ST3CH1_PB15 \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, NORMP)

/* SHRTIMER_ST4CH0 */
#define SHRTIMER_ST4CH0_PC8 \
	GD32_PINMUX_AFIO('C', 8, ALTERNATE, NORMP)

/* SHRTIMER_ST4CH1 */
#define SHRTIMER_ST4CH1_PC9 \
	GD32_PINMUX_AFIO('C', 9, ALTERNATE, NORMP)

/* SPI0_IO2 */
#define SPI0_IO2_PA2_NORMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, SPI0_NORMP)
#define SPI0_IO2_PB6_RMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, SPI0_RMP)

/* SPI0_IO3 */
#define SPI0_IO3_PA3_NORMP \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, SPI0_NORMP)
#define SPI0_IO3_PB7_RMP \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, SPI0_RMP)

