nandojve/hal_gigadevice/include/dt-bindings/pinctrl/gd32e507r(c-e)xx-pinctrl.h
/* SPI0_MISO */
#define SPI0_MISO_PA6_INP_NORMP \
	GD32_PINMUX_AFIO('A', 6, GPIO_IN, SPI0_NORMP)
#define SPI0_MISO_PA6_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 6, ALTERNATE, SPI0_NORMP)
#define SPI0_MISO_PB4_INP_RMP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, SPI0_RMP)
#define SPI0_MISO_PB4_OUT_RMP \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, SPI0_RMP)

/* SPI0_MOSI */
#define SPI0_MOSI_PA7_INP_NORMP \
	GD32_PINMUX_AFIO('A', 7, GPIO_IN, SPI0_NORMP)
#define SPI0_MOSI_PA7_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, SPI0_NORMP)
#define SPI0_MOSI_PB5_INP_RMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, SPI0_RMP)
#define SPI0_MOSI_PB5_OUT_RMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, SPI0_RMP)

/* SPI0_NSS */
#define SPI0_NSS_PA4_INP_NORMP \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, SPI0_NORMP)
#define SPI0_NSS_PA4_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, SPI0_NORMP)
#define SPI0_NSS_PA15_INP_RMP \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, SPI0_RMP)
#define SPI0_NSS_PA15_OUT_RMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, SPI0_RMP)

/* SPI0_SCK */
#define SPI0_SCK_PA5_INP_NORMP \
	GD32_PINMUX_AFIO('A', 5, GPIO_IN, SPI0_NORMP)
#define SPI0_SCK_PA5_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 5, ALTERNATE, SPI0_NORMP)
#define SPI0_SCK_PB3_INP_RMP \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, SPI0_RMP)
#define SPI0_SCK_PB3_OUT_RMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, SPI0_RMP)

/* SPI1_MISO */
#define SPI1_MISO_PB14_INP \
	GD32_PINMUX_AFIO('B', 14, GPIO_IN, NORMP)
#define SPI1_MISO_PB14_OUT \
	GD32_PINMUX_AFIO('B', 14, ALTERNATE, NORMP)

/* SPI1_MOSI */
#define SPI1_MOSI_PB15_INP \
	GD32_PINMUX_AFIO('B', 15, GPIO_IN, NORMP)
#define SPI1_MOSI_PB15_OUT \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, NORMP)

/* SPI1_NSS */
#define SPI1_NSS_PB12_INP \
	GD32_PINMUX_AFIO('B', 12, GPIO_IN, NORMP)
#define SPI1_NSS_PB12_OUT \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* SPI1_SCK */
#define SPI1_SCK_PB13_INP \
	GD32_PINMUX_AFIO('B', 13, GPIO_IN, NORMP)
#define SPI1_SCK_PB13_OUT \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* SPI2_MISO */
#define SPI2_MISO_PB4_INP_NORMP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, SPI2_NORMP)
#define SPI2_MISO_PB4_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, SPI2_NORMP)
#define SPI2_MISO_PC11_INP_RMP \
	GD32_PINMUX_AFIO('C', 11, GPIO_IN, SPI2_RMP)
#define SPI2_MISO_PC11_OUT_RMP \
	GD32_PINMUX_AFIO('C', 11, ALTERNATE, SPI2_RMP)

/* SPI2_MOSI */
#define SPI2_MOSI_PB5_INP_NORMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, SPI2_NORMP)
#define SPI2_MOSI_PB5_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, SPI2_NORMP)
#define SPI2_MOSI_PC12_INP_RMP \
	GD32_PINMUX_AFIO('C', 12, GPIO_IN, SPI2_RMP)
#define SPI2_MOSI_PC12_OUT_RMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, SPI2_RMP)

/* SPI2_NSS */
#define SPI2_NSS_PA15_INP_NORMP \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, SPI2_NORMP)
#define SPI2_NSS_PA15_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, SPI2_NORMP)
#define SPI2_NSS_PA4_INP_RMP \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, SPI2_RMP)
#define SPI2_NSS_PA4_OUT_RMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, SPI2_RMP)

/* SPI2_SCK */
#define SPI2_SCK_PB3_INP_NORMP \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, SPI2_NORMP)
#define SPI2_SCK_PB3_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, SPI2_NORMP)
#define SPI2_SCK_PC10_INP_RMP \
	GD32_PINMUX_AFIO('C', 10, GPIO_IN, SPI2_RMP)
#define SPI2_SCK_PC10_OUT_RMP \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, SPI2_RMP)

/* TAMPER_RTC */
#define TAMPER_RTC_PC13 \
	GD32_PINMUX_AFIO('C', 13, GPIO_IN, NORMP)

/* TIMER0_BRKIN */
#define TIMER0_BRKIN_PB12 \
	GD32_PINMUX_AFIO('B', 12, GPIO_IN, NORMP)

/* TIMER0_CH0 */
#define TIMER0_CH0_PA8_INP_NORMP \
	GD32_PINMUX_AFIO('A', 8, GPIO_IN, TIMER0_NORMP)
#define TIMER0_CH0_PA8_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH0_PA8_INP_PRMP \
	GD32_PINMUX_AFIO('A', 8, GPIO_IN, TIMER0_PRMP)
#define TIMER0_CH0_PA8_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, TIMER0_PRMP)

/* TIMER0_CH0_ON */
#define TIMER0_CH0_ON_PB13_NORMP \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH0_ON_PA7_PRMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, TIMER0_PRMP)

/* TIMER0_CH1 */
#define TIMER0_CH1_PA9_INP_NORMP \
	GD32_PINMUX_AFIO('A', 9, GPIO_IN, TIMER0_NORMP)
#define TIMER0_CH1_PA9_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH1_PA9_INP_PRMP \
	GD32_PINMUX_AFIO('A', 9, GPIO_IN, TIMER0_PRMP)
#define TIMER0_CH1_PA9_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, TIMER0_PRMP)

/* TIMER0_CH1_ON */
#define TIMER0_CH1_ON_PB14_NORMP \
	GD32_PINMUX_AFIO('B', 14, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH1_ON_PB0_PRMP \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, TIMER0_PRMP)

/* TIMER0_CH2 */
#define TIMER0_CH2_PA10_INP_NORMP \
	GD32_PINMUX_AFIO('A', 10, GPIO_IN, TIMER0_NORMP)
#define TIMER0_CH2_PA10_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH2_PA10_INP_PRMP \
	GD32_PINMUX_AFIO('A', 10, GPIO_IN, TIMER0_PRMP)
#define TIMER0_CH2_PA10_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, TIMER0_PRMP)

/* TIMER0_CH2_ON */
#define TIMER0_CH2_ON_PB15_NORMP \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH2_ON_PB1_PRMP \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, TIMER0_PRMP)

/* TIMER0_CH3 */
#define TIMER0_CH3_PA11_INP_NORMP \
	GD32_PINMUX_AFIO('A', 11, GPIO_IN, TIMER0_NORMP)
#define TIMER0_CH3_PA11_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 11, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH3_PA11_INP_PRMP \
	GD32_PINMUX_AFIO('A', 11, GPIO_IN, TIMER0_PRMP)
#define TIMER0_CH3_PA11_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 11, ALTERNATE, TIMER0_PRMP)

/* TIMER0_ETI */
#define TIMER0_ETI_PA12_NORMP \
	GD32_PINMUX_AFIO('A', 12, GPIO_IN, TIMER0_NORMP)
#define TIMER0_ETI_PA12_PRMP \
	GD32_PINMUX_AFIO('A', 12, GPIO_IN, TIMER0_PRMP)

/* TIMER10_CH0 */
#define TIMER10_CH0_PB9_INP_NORMP \
	GD32_PINMUX_AFIO('B', 9, GPIO_IN, TIMER10_NORMP)
#define TIMER10_CH0_PB9_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 9, ALTERNATE, TIMER10_NORMP)

/* TIMER11_CH0 */
#define TIMER11_CH0_PB14_INP \
	GD32_PINMUX_AFIO('B', 14, GPIO_IN, NORMP)
#define TIMER11_CH0_PB14_OUT \
	GD32_PINMUX_AFIO('B', 14, ALTERNATE, NORMP)

/* TIMER11_CH1 */
#define TIMER11_CH1_PB15_INP \
	GD32_PINMUX_AFIO('B', 15, GPIO_IN, NORMP)
#define TIMER11_CH1_PB15_OUT \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, NORMP)

/* TIMER12_CH0 */
#define TIMER12_CH0_PA6_INP_NORMP \
	GD32_PINMUX_AFIO('A', 6, GPIO_IN, TIMER12_NORMP)
#define TIMER12_CH0_PA6_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 6, ALTERNATE, TIMER12_NORMP)

/* TIMER13_CH0 */
#define TIMER13_CH0_PA7_INP_NORMP \
	GD32_PINMUX_AFIO('A', 7, GPIO_IN, TIMER13_NORMP)
#define TIMER13_CH0_PA7_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, TIMER13_NORMP)

/* TIMER1_CH0 */
#define TIMER1_CH0_PA0_INP_NORMP \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, TIMER1_NORMP)
#define TIMER1_CH0_PA0_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 0, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH0_PA0_INP_PRMP2 \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, TIMER1_PRMP2)
#define TIMER1_CH0_PA0_OUT_PRMP2 \
	GD32_PINMUX_AFIO('A', 0, ALTERNATE, TIMER1_PRMP2)
#define TIMER1_CH0_PA15_INP_PRMP1 \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, TIMER1_PRMP1)
#define TIMER1_CH0_PA15_OUT_PRMP1 \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, TIMER1_PRMP1)
#define TIMER1_CH0_PA15_INP_FRMP \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, TIMER1_FRMP)
#define TIMER1_CH0_PA15_OUT_FRMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, TIMER1_FRMP)

/* TIMER1_CH1 */
#define TIMER1_CH1_PA1_INP_NORMP \
	GD32_PINMUX_AFIO('A', 1, GPIO_IN, TIMER1_NORMP)
#define TIMER1_CH1_PA1_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH1_PA1_INP_PRMP2 \
	GD32_PINMUX_AFIO('A', 1, GPIO_IN, TIMER1_PRMP2)
#define TIMER1_CH1_PA1_OUT_PRMP2 \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, TIMER1_PRMP2)
#define TIMER1_CH1_PB3_INP_PRMP1 \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, TIMER1_PRMP1)
#define TIMER1_CH1_PB3_OUT_PRMP1 \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, TIMER1_PRMP1)
#define TIMER1_CH1_PB3_INP_FRMP \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, TIMER1_FRMP)
#define TIMER1_CH1_PB3_OUT_FRMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, TIMER1_FRMP)

