nandojve/hal_gigadevice/include/dt-bindings/pinctrl/gd32e507r(c-e)xx-pinctrl.h
/* TIMER1_CH2 */
#define TIMER1_CH2_PA2_INP_NORMP \
	GD32_PINMUX_AFIO('A', 2, GPIO_IN, TIMER1_NORMP)
#define TIMER1_CH2_PA2_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH2_PA2_INP_PRMP1 \
	GD32_PINMUX_AFIO('A', 2, GPIO_IN, TIMER1_PRMP1)
#define TIMER1_CH2_PA2_OUT_PRMP1 \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, TIMER1_PRMP1)
#define TIMER1_CH2_PB10_INP_PRMP2 \
	GD32_PINMUX_AFIO('B', 10, GPIO_IN, TIMER1_PRMP2)
#define TIMER1_CH2_PB10_OUT_PRMP2 \
	GD32_PINMUX_AFIO('B', 10, ALTERNATE, TIMER1_PRMP2)
#define TIMER1_CH2_PB10_INP_FRMP \
	GD32_PINMUX_AFIO('B', 10, GPIO_IN, TIMER1_FRMP)
#define TIMER1_CH2_PB10_OUT_FRMP \
	GD32_PINMUX_AFIO('B', 10, ALTERNATE, TIMER1_FRMP)

/* TIMER1_CH3 */
#define TIMER1_CH3_PA3_INP_NORMP \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, TIMER1_NORMP)
#define TIMER1_CH3_PA3_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH3_PA3_INP_PRMP1 \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, TIMER1_PRMP1)
#define TIMER1_CH3_PA3_OUT_PRMP1 \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, TIMER1_PRMP1)
#define TIMER1_CH3_PB11_INP_PRMP2 \
	GD32_PINMUX_AFIO('B', 11, GPIO_IN, TIMER1_PRMP2)
#define TIMER1_CH3_PB11_OUT_PRMP2 \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, TIMER1_PRMP2)
#define TIMER1_CH3_PB11_INP_FRMP \
	GD32_PINMUX_AFIO('B', 11, GPIO_IN, TIMER1_FRMP)
#define TIMER1_CH3_PB11_OUT_FRMP \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, TIMER1_FRMP)

/* TIMER1_ETI */
#define TIMER1_ETI_PA0_NORMP \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, TIMER1_NORMP)
#define TIMER1_ETI_PA0_PRMP2 \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, TIMER1_PRMP2)
#define TIMER1_ETI_PA15_PRMP1 \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, TIMER1_PRMP1)
#define TIMER1_ETI_PA15_FRMP \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, TIMER1_FRMP)

/* TIMER2_CH0 */
#define TIMER2_CH0_PA6_INP_NORMP \
	GD32_PINMUX_AFIO('A', 6, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH0_PA6_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 6, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH0_PB4_INP_PRMP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, TIMER2_PRMP)
#define TIMER2_CH0_PB4_OUT_PRMP \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, TIMER2_PRMP)
#define TIMER2_CH0_PC6_INP_FRMP \
	GD32_PINMUX_AFIO('C', 6, GPIO_IN, TIMER2_FRMP)
#define TIMER2_CH0_PC6_OUT_FRMP \
	GD32_PINMUX_AFIO('C', 6, ALTERNATE, TIMER2_FRMP)

/* TIMER2_CH1 */
#define TIMER2_CH1_PA7_INP_NORMP \
	GD32_PINMUX_AFIO('A', 7, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH1_PA7_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH1_PB5_INP_PRMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, TIMER2_PRMP)
#define TIMER2_CH1_PB5_OUT_PRMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, TIMER2_PRMP)
#define TIMER2_CH1_PC7_INP_FRMP \
	GD32_PINMUX_AFIO('C', 7, GPIO_IN, TIMER2_FRMP)
#define TIMER2_CH1_PC7_OUT_FRMP \
	GD32_PINMUX_AFIO('C', 7, ALTERNATE, TIMER2_FRMP)

/* TIMER2_CH2 */
#define TIMER2_CH2_PB0_INP_NORMP \
	GD32_PINMUX_AFIO('B', 0, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH2_PB0_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH2_PB0_INP_PRMP \
	GD32_PINMUX_AFIO('B', 0, GPIO_IN, TIMER2_PRMP)
#define TIMER2_CH2_PB0_OUT_PRMP \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, TIMER2_PRMP)
#define TIMER2_CH2_PC8_INP_FRMP \
	GD32_PINMUX_AFIO('C', 8, GPIO_IN, TIMER2_FRMP)
#define TIMER2_CH2_PC8_OUT_FRMP \
	GD32_PINMUX_AFIO('C', 8, ALTERNATE, TIMER2_FRMP)

/* TIMER2_CH3 */
#define TIMER2_CH3_PB1_INP_NORMP \
	GD32_PINMUX_AFIO('B', 1, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH3_PB1_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH3_PB1_INP_PRMP \
	GD32_PINMUX_AFIO('B', 1, GPIO_IN, TIMER2_PRMP)
#define TIMER2_CH3_PB1_OUT_PRMP \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, TIMER2_PRMP)
#define TIMER2_CH3_PC9_INP_FRMP \
	GD32_PINMUX_AFIO('C', 9, GPIO_IN, TIMER2_FRMP)
#define TIMER2_CH3_PC9_OUT_FRMP \
	GD32_PINMUX_AFIO('C', 9, ALTERNATE, TIMER2_FRMP)

/* TIMER2_ETI */
#define TIMER2_ETI_PD2 \
	GD32_PINMUX_AFIO('D', 2, GPIO_IN, NORMP)

/* TIMER3_CH0 */
#define TIMER3_CH0_PB6_INP_NORMP \
	GD32_PINMUX_AFIO('B', 6, GPIO_IN, TIMER3_NORMP)
#define TIMER3_CH0_PB6_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, TIMER3_NORMP)

/* TIMER3_CH1 */
#define TIMER3_CH1_PB7_INP_NORMP \
	GD32_PINMUX_AFIO('B', 7, GPIO_IN, TIMER3_NORMP)
#define TIMER3_CH1_PB7_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, TIMER3_NORMP)

/* TIMER3_CH2 */
#define TIMER3_CH2_PB8_INP_NORMP \
	GD32_PINMUX_AFIO('B', 8, GPIO_IN, TIMER3_NORMP)
#define TIMER3_CH2_PB8_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 8, ALTERNATE, TIMER3_NORMP)

/* TIMER3_CH3 */
#define TIMER3_CH3_PB9_INP_NORMP \
	GD32_PINMUX_AFIO('B', 9, GPIO_IN, TIMER3_NORMP)
#define TIMER3_CH3_PB9_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 9, ALTERNATE, TIMER3_NORMP)

/* TIMER4_CH0 */
#define TIMER4_CH0_PA0_INP \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, NORMP)
#define TIMER4_CH0_PA0_OUT \
	GD32_PINMUX_AFIO('A', 0, ALTERNATE, NORMP)

/* TIMER4_CH1 */
#define TIMER4_CH1_PA1_INP \
	GD32_PINMUX_AFIO('A', 1, GPIO_IN, NORMP)
#define TIMER4_CH1_PA1_OUT \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, NORMP)

/* TIMER4_CH2 */
#define TIMER4_CH2_PA2_INP \
	GD32_PINMUX_AFIO('A', 2, GPIO_IN, NORMP)
#define TIMER4_CH2_PA2_OUT \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, NORMP)

/* TIMER4_CH3 */
#define TIMER4_CH3_PA3_INP \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, NORMP)
#define TIMER4_CH3_PA3_OUT \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, NORMP)

/* TIMER7_BRKIN */
#define TIMER7_BRKIN_PA6 \
	GD32_PINMUX_AFIO('A', 6, GPIO_IN, NORMP)

/* TIMER7_CH0 */
#define TIMER7_CH0_PC6_INP \
	GD32_PINMUX_AFIO('C', 6, GPIO_IN, NORMP)
#define TIMER7_CH0_PC6_OUT \
	GD32_PINMUX_AFIO('C', 6, ALTERNATE, NORMP)

/* TIMER7_CH0_ON */
#define TIMER7_CH0_ON_PA7 \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, NORMP)

/* TIMER7_CH1 */
#define TIMER7_CH1_PC7_INP \
	GD32_PINMUX_AFIO('C', 7, GPIO_IN, NORMP)
#define TIMER7_CH1_PC7_OUT \
	GD32_PINMUX_AFIO('C', 7, ALTERNATE, NORMP)

/* TIMER7_CH1_ON */
#define TIMER7_CH1_ON_PB0 \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, NORMP)

/* TIMER7_CH2 */
#define TIMER7_CH2_PC8_INP \
	GD32_PINMUX_AFIO('C', 8, GPIO_IN, NORMP)
#define TIMER7_CH2_PC8_OUT \
	GD32_PINMUX_AFIO('C', 8, ALTERNATE, NORMP)

/* TIMER7_CH2_ON */
#define TIMER7_CH2_ON_PB1 \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, NORMP)

/* TIMER7_CH3 */
#define TIMER7_CH3_PC9_INP \
	GD32_PINMUX_AFIO('C', 9, GPIO_IN, NORMP)
#define TIMER7_CH3_PC9_OUT \
	GD32_PINMUX_AFIO('C', 9, ALTERNATE, NORMP)

